GopalSaraf/Practicals/PSDL/include/proc/pic18lf27k42.inc
// Register: CLC4GLS2
#define CLC4GLS2 CLC4GLS2
CLC4GLS2                                 equ 03C5Eh
// bitfield definitions
CLC4GLS2_G3D1N_POSN                      equ 0000h
CLC4GLS2_G3D1N_POSITION                  equ 0000h
CLC4GLS2_G3D1N_SIZE                      equ 0001h
CLC4GLS2_G3D1N_LENGTH                    equ 0001h
CLC4GLS2_G3D1N_MASK                      equ 0001h
CLC4GLS2_G3D1T_POSN                      equ 0001h
CLC4GLS2_G3D1T_POSITION                  equ 0001h
CLC4GLS2_G3D1T_SIZE                      equ 0001h
CLC4GLS2_G3D1T_LENGTH                    equ 0001h
CLC4GLS2_G3D1T_MASK                      equ 0002h
CLC4GLS2_G3D2N_POSN                      equ 0002h
CLC4GLS2_G3D2N_POSITION                  equ 0002h
CLC4GLS2_G3D2N_SIZE                      equ 0001h
CLC4GLS2_G3D2N_LENGTH                    equ 0001h
CLC4GLS2_G3D2N_MASK                      equ 0004h
CLC4GLS2_G3D2T_POSN                      equ 0003h
CLC4GLS2_G3D2T_POSITION                  equ 0003h
CLC4GLS2_G3D2T_SIZE                      equ 0001h
CLC4GLS2_G3D2T_LENGTH                    equ 0001h
CLC4GLS2_G3D2T_MASK                      equ 0008h
CLC4GLS2_G3D3N_POSN                      equ 0004h
CLC4GLS2_G3D3N_POSITION                  equ 0004h
CLC4GLS2_G3D3N_SIZE                      equ 0001h
CLC4GLS2_G3D3N_LENGTH                    equ 0001h
CLC4GLS2_G3D3N_MASK                      equ 0010h
CLC4GLS2_G3D3T_POSN                      equ 0005h
CLC4GLS2_G3D3T_POSITION                  equ 0005h
CLC4GLS2_G3D3T_SIZE                      equ 0001h
CLC4GLS2_G3D3T_LENGTH                    equ 0001h
CLC4GLS2_G3D3T_MASK                      equ 0020h
CLC4GLS2_G3D4N_POSN                      equ 0006h
CLC4GLS2_G3D4N_POSITION                  equ 0006h
CLC4GLS2_G3D4N_SIZE                      equ 0001h
CLC4GLS2_G3D4N_LENGTH                    equ 0001h
CLC4GLS2_G3D4N_MASK                      equ 0040h
CLC4GLS2_G3D4T_POSN                      equ 0007h
CLC4GLS2_G3D4T_POSITION                  equ 0007h
CLC4GLS2_G3D4T_SIZE                      equ 0001h
CLC4GLS2_G3D4T_LENGTH                    equ 0001h
CLC4GLS2_G3D4T_MASK                      equ 0080h
CLC4GLS2_LC4G3D1N_POSN                   equ 0000h
CLC4GLS2_LC4G3D1N_POSITION               equ 0000h
CLC4GLS2_LC4G3D1N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D1N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D1N_MASK                   equ 0001h
CLC4GLS2_LC4G3D1T_POSN                   equ 0001h
CLC4GLS2_LC4G3D1T_POSITION               equ 0001h
CLC4GLS2_LC4G3D1T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D1T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D1T_MASK                   equ 0002h
CLC4GLS2_LC4G3D2N_POSN                   equ 0002h
CLC4GLS2_LC4G3D2N_POSITION               equ 0002h
CLC4GLS2_LC4G3D2N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D2N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D2N_MASK                   equ 0004h
CLC4GLS2_LC4G3D2T_POSN                   equ 0003h
CLC4GLS2_LC4G3D2T_POSITION               equ 0003h
CLC4GLS2_LC4G3D2T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D2T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D2T_MASK                   equ 0008h
CLC4GLS2_LC4G3D3N_POSN                   equ 0004h
CLC4GLS2_LC4G3D3N_POSITION               equ 0004h
CLC4GLS2_LC4G3D3N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D3N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D3N_MASK                   equ 0010h
CLC4GLS2_LC4G3D3T_POSN                   equ 0005h
CLC4GLS2_LC4G3D3T_POSITION               equ 0005h
CLC4GLS2_LC4G3D3T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D3T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D3T_MASK                   equ 0020h
CLC4GLS2_LC4G3D4N_POSN                   equ 0006h
CLC4GLS2_LC4G3D4N_POSITION               equ 0006h
CLC4GLS2_LC4G3D4N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D4N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D4N_MASK                   equ 0040h
CLC4GLS2_LC4G3D4T_POSN                   equ 0007h
CLC4GLS2_LC4G3D4T_POSITION               equ 0007h
CLC4GLS2_LC4G3D4T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D4T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D4T_MASK                   equ 0080h

// Register: CLC4GLS3
#define CLC4GLS3 CLC4GLS3
CLC4GLS3                                 equ 03C5Fh
// bitfield definitions
CLC4GLS3_G4D1N_POSN                      equ 0000h
CLC4GLS3_G4D1N_POSITION                  equ 0000h
CLC4GLS3_G4D1N_SIZE                      equ 0001h
CLC4GLS3_G4D1N_LENGTH                    equ 0001h
CLC4GLS3_G4D1N_MASK                      equ 0001h
CLC4GLS3_G4D1T_POSN                      equ 0001h
CLC4GLS3_G4D1T_POSITION                  equ 0001h
CLC4GLS3_G4D1T_SIZE                      equ 0001h
CLC4GLS3_G4D1T_LENGTH                    equ 0001h
CLC4GLS3_G4D1T_MASK                      equ 0002h
CLC4GLS3_G4D2N_POSN                      equ 0002h
CLC4GLS3_G4D2N_POSITION                  equ 0002h
CLC4GLS3_G4D2N_SIZE                      equ 0001h
CLC4GLS3_G4D2N_LENGTH                    equ 0001h
CLC4GLS3_G4D2N_MASK                      equ 0004h
CLC4GLS3_G4D2T_POSN                      equ 0003h
CLC4GLS3_G4D2T_POSITION                  equ 0003h
CLC4GLS3_G4D2T_SIZE                      equ 0001h
CLC4GLS3_G4D2T_LENGTH                    equ 0001h
CLC4GLS3_G4D2T_MASK                      equ 0008h
CLC4GLS3_G4D3N_POSN                      equ 0004h
CLC4GLS3_G4D3N_POSITION                  equ 0004h
CLC4GLS3_G4D3N_SIZE                      equ 0001h
CLC4GLS3_G4D3N_LENGTH                    equ 0001h
CLC4GLS3_G4D3N_MASK                      equ 0010h
CLC4GLS3_G4D3T_POSN                      equ 0005h
CLC4GLS3_G4D3T_POSITION                  equ 0005h
CLC4GLS3_G4D3T_SIZE                      equ 0001h
CLC4GLS3_G4D3T_LENGTH                    equ 0001h
CLC4GLS3_G4D3T_MASK                      equ 0020h
CLC4GLS3_G4D4N_POSN                      equ 0006h
CLC4GLS3_G4D4N_POSITION                  equ 0006h
CLC4GLS3_G4D4N_SIZE                      equ 0001h
CLC4GLS3_G4D4N_LENGTH                    equ 0001h
CLC4GLS3_G4D4N_MASK                      equ 0040h
CLC4GLS3_G4D4T_POSN                      equ 0007h
CLC4GLS3_G4D4T_POSITION                  equ 0007h
CLC4GLS3_G4D4T_SIZE                      equ 0001h
CLC4GLS3_G4D4T_LENGTH                    equ 0001h
CLC4GLS3_G4D4T_MASK                      equ 0080h
CLC4GLS3_LC4G4D1N_POSN                   equ 0000h
CLC4GLS3_LC4G4D1N_POSITION               equ 0000h
CLC4GLS3_LC4G4D1N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D1N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D1N_MASK                   equ 0001h
CLC4GLS3_LC4G4D1T_POSN                   equ 0001h
CLC4GLS3_LC4G4D1T_POSITION               equ 0001h
CLC4GLS3_LC4G4D1T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D1T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D1T_MASK                   equ 0002h
CLC4GLS3_LC4G4D2N_POSN                   equ 0002h
CLC4GLS3_LC4G4D2N_POSITION               equ 0002h
CLC4GLS3_LC4G4D2N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D2N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D2N_MASK                   equ 0004h
CLC4GLS3_LC4G4D2T_POSN                   equ 0003h
CLC4GLS3_LC4G4D2T_POSITION               equ 0003h
CLC4GLS3_LC4G4D2T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D2T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D2T_MASK                   equ 0008h
CLC4GLS3_LC4G4D3N_POSN                   equ 0004h
CLC4GLS3_LC4G4D3N_POSITION               equ 0004h
CLC4GLS3_LC4G4D3N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D3N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D3N_MASK                   equ 0010h
CLC4GLS3_LC4G4D3T_POSN                   equ 0005h
CLC4GLS3_LC4G4D3T_POSITION               equ 0005h
CLC4GLS3_LC4G4D3T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D3T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D3T_MASK                   equ 0020h
CLC4GLS3_LC4G4D4N_POSN                   equ 0006h
CLC4GLS3_LC4G4D4N_POSITION               equ 0006h
CLC4GLS3_LC4G4D4N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D4N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D4N_MASK                   equ 0040h
CLC4GLS3_LC4G4D4T_POSN                   equ 0007h
CLC4GLS3_LC4G4D4T_POSITION               equ 0007h
CLC4GLS3_LC4G4D4T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D4T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D4T_MASK                   equ 0080h

// Register: CLC3CON
#define CLC3CON CLC3CON
CLC3CON                                  equ 03C60h
// bitfield definitions
CLC3CON_MODE_POSN                        equ 0000h
CLC3CON_MODE_POSITION                    equ 0000h
CLC3CON_MODE_SIZE                        equ 0003h
CLC3CON_MODE_LENGTH                      equ 0003h
CLC3CON_MODE_MASK                        equ 0007h
CLC3CON_INTN_POSN                        equ 0003h
CLC3CON_INTN_POSITION                    equ 0003h
CLC3CON_INTN_SIZE                        equ 0001h
CLC3CON_INTN_LENGTH                      equ 0001h
CLC3CON_INTN_MASK                        equ 0008h
CLC3CON_INTP_POSN                        equ 0004h
CLC3CON_INTP_POSITION                    equ 0004h
CLC3CON_INTP_SIZE                        equ 0001h
CLC3CON_INTP_LENGTH                      equ 0001h
CLC3CON_INTP_MASK                        equ 0010h
CLC3CON_OUT_POSN                         equ 0005h
CLC3CON_OUT_POSITION                     equ 0005h
CLC3CON_OUT_SIZE                         equ 0001h
CLC3CON_OUT_LENGTH                       equ 0001h
CLC3CON_OUT_MASK                         equ 0020h
CLC3CON_OE_POSN                          equ 0006h
CLC3CON_OE_POSITION                      equ 0006h
CLC3CON_OE_SIZE                          equ 0001h
CLC3CON_OE_LENGTH                        equ 0001h
CLC3CON_OE_MASK                          equ 0040h
CLC3CON_EN_POSN                          equ 0007h
CLC3CON_EN_POSITION                      equ 0007h
CLC3CON_EN_SIZE                          equ 0001h
CLC3CON_EN_LENGTH                        equ 0001h
CLC3CON_EN_MASK                          equ 0080h
CLC3CON_MODE0_POSN                       equ 0000h
CLC3CON_MODE0_POSITION                   equ 0000h
CLC3CON_MODE0_SIZE                       equ 0001h
CLC3CON_MODE0_LENGTH                     equ 0001h
CLC3CON_MODE0_MASK                       equ 0001h
CLC3CON_MODE1_POSN                       equ 0001h
CLC3CON_MODE1_POSITION                   equ 0001h
CLC3CON_MODE1_SIZE                       equ 0001h
CLC3CON_MODE1_LENGTH                     equ 0001h
CLC3CON_MODE1_MASK                       equ 0002h
CLC3CON_MODE2_POSN                       equ 0002h
CLC3CON_MODE2_POSITION                   equ 0002h
CLC3CON_MODE2_SIZE                       equ 0001h
CLC3CON_MODE2_LENGTH                     equ 0001h
CLC3CON_MODE2_MASK                       equ 0004h
CLC3CON_LC3MODE_POSN                     equ 0000h
CLC3CON_LC3MODE_POSITION                 equ 0000h
CLC3CON_LC3MODE_SIZE                     equ 0003h
CLC3CON_LC3MODE_LENGTH                   equ 0003h
CLC3CON_LC3MODE_MASK                     equ 0007h
CLC3CON_LC3INTN_POSN                     equ 0003h
CLC3CON_LC3INTN_POSITION                 equ 0003h
CLC3CON_LC3INTN_SIZE                     equ 0001h
CLC3CON_LC3INTN_LENGTH                   equ 0001h
CLC3CON_LC3INTN_MASK                     equ 0008h
CLC3CON_LC3INTP_POSN                     equ 0004h
CLC3CON_LC3INTP_POSITION                 equ 0004h
CLC3CON_LC3INTP_SIZE                     equ 0001h
CLC3CON_LC3INTP_LENGTH                   equ 0001h
CLC3CON_LC3INTP_MASK                     equ 0010h
CLC3CON_LC3OUT_POSN                      equ 0005h
CLC3CON_LC3OUT_POSITION                  equ 0005h
CLC3CON_LC3OUT_SIZE                      equ 0001h
CLC3CON_LC3OUT_LENGTH                    equ 0001h
CLC3CON_LC3OUT_MASK                      equ 0020h
CLC3CON_LC3OE_POSN                       equ 0006h
CLC3CON_LC3OE_POSITION                   equ 0006h
CLC3CON_LC3OE_SIZE                       equ 0001h
CLC3CON_LC3OE_LENGTH                     equ 0001h
CLC3CON_LC3OE_MASK                       equ 0040h
CLC3CON_LC3EN_POSN                       equ 0007h
CLC3CON_LC3EN_POSITION                   equ 0007h
CLC3CON_LC3EN_SIZE                       equ 0001h
CLC3CON_LC3EN_LENGTH                     equ 0001h
CLC3CON_LC3EN_MASK                       equ 0080h
CLC3CON_LC3MODE0_POSN                    equ 0000h
CLC3CON_LC3MODE0_POSITION                equ 0000h
CLC3CON_LC3MODE0_SIZE                    equ 0001h
CLC3CON_LC3MODE0_LENGTH                  equ 0001h
CLC3CON_LC3MODE0_MASK                    equ 0001h
CLC3CON_LC3MODE1_POSN                    equ 0001h
CLC3CON_LC3MODE1_POSITION                equ 0001h
CLC3CON_LC3MODE1_SIZE                    equ 0001h
CLC3CON_LC3MODE1_LENGTH                  equ 0001h
CLC3CON_LC3MODE1_MASK                    equ 0002h
CLC3CON_LC3MODE2_POSN                    equ 0002h
CLC3CON_LC3MODE2_POSITION                equ 0002h
CLC3CON_LC3MODE2_SIZE                    equ 0001h
CLC3CON_LC3MODE2_LENGTH                  equ 0001h
CLC3CON_LC3MODE2_MASK                    equ 0004h

// Register: CLC3POL
#define CLC3POL CLC3POL
CLC3POL                                  equ 03C61h
// bitfield definitions
CLC3POL_G1POL_POSN                       equ 0000h
CLC3POL_G1POL_POSITION                   equ 0000h
CLC3POL_G1POL_SIZE                       equ 0001h
CLC3POL_G1POL_LENGTH                     equ 0001h
CLC3POL_G1POL_MASK                       equ 0001h
CLC3POL_G2POL_POSN                       equ 0001h
CLC3POL_G2POL_POSITION                   equ 0001h
CLC3POL_G2POL_SIZE                       equ 0001h
CLC3POL_G2POL_LENGTH                     equ 0001h
CLC3POL_G2POL_MASK                       equ 0002h
CLC3POL_G3POL_POSN                       equ 0002h
CLC3POL_G3POL_POSITION                   equ 0002h
CLC3POL_G3POL_SIZE                       equ 0001h
CLC3POL_G3POL_LENGTH                     equ 0001h
CLC3POL_G3POL_MASK                       equ 0004h
CLC3POL_G4POL_POSN                       equ 0003h
CLC3POL_G4POL_POSITION                   equ 0003h
CLC3POL_G4POL_SIZE                       equ 0001h
CLC3POL_G4POL_LENGTH                     equ 0001h
CLC3POL_G4POL_MASK                       equ 0008h
CLC3POL_POL_POSN                         equ 0007h
CLC3POL_POL_POSITION                     equ 0007h
CLC3POL_POL_SIZE                         equ 0001h
CLC3POL_POL_LENGTH                       equ 0001h
CLC3POL_POL_MASK                         equ 0080h
CLC3POL_LC3G1POL_POSN                    equ 0000h
CLC3POL_LC3G1POL_POSITION                equ 0000h
CLC3POL_LC3G1POL_SIZE                    equ 0001h
CLC3POL_LC3G1POL_LENGTH                  equ 0001h
CLC3POL_LC3G1POL_MASK                    equ 0001h
CLC3POL_LC3G2POL_POSN                    equ 0001h
CLC3POL_LC3G2POL_POSITION                equ 0001h
CLC3POL_LC3G2POL_SIZE                    equ 0001h
CLC3POL_LC3G2POL_LENGTH                  equ 0001h
CLC3POL_LC3G2POL_MASK                    equ 0002h
CLC3POL_LC3G3POL_POSN                    equ 0002h
CLC3POL_LC3G3POL_POSITION                equ 0002h
CLC3POL_LC3G3POL_SIZE                    equ 0001h
CLC3POL_LC3G3POL_LENGTH                  equ 0001h
CLC3POL_LC3G3POL_MASK                    equ 0004h
CLC3POL_LC3G4POL_POSN                    equ 0003h
CLC3POL_LC3G4POL_POSITION                equ 0003h
CLC3POL_LC3G4POL_SIZE                    equ 0001h
CLC3POL_LC3G4POL_LENGTH                  equ 0001h
CLC3POL_LC3G4POL_MASK                    equ 0008h
CLC3POL_LC3POL_POSN                      equ 0007h
CLC3POL_LC3POL_POSITION                  equ 0007h
CLC3POL_LC3POL_SIZE                      equ 0001h
CLC3POL_LC3POL_LENGTH                    equ 0001h
CLC3POL_LC3POL_MASK                      equ 0080h

// Register: CLC3SEL0
#define CLC3SEL0 CLC3SEL0
CLC3SEL0                                 equ 03C62h
// bitfield definitions
CLC3SEL0_D1S_POSN                        equ 0000h
CLC3SEL0_D1S_POSITION                    equ 0000h
CLC3SEL0_D1S_SIZE                        equ 0008h
CLC3SEL0_D1S_LENGTH                      equ 0008h
CLC3SEL0_D1S_MASK                        equ 00FFh
CLC3SEL0_LC3D1S_POSN                     equ 0000h
CLC3SEL0_LC3D1S_POSITION                 equ 0000h
CLC3SEL0_LC3D1S_SIZE                     equ 0008h
CLC3SEL0_LC3D1S_LENGTH                   equ 0008h
CLC3SEL0_LC3D1S_MASK                     equ 00FFh
CLC3SEL0_D1S0_POSN                       equ 0000h
CLC3SEL0_D1S0_POSITION                   equ 0000h
CLC3SEL0_D1S0_SIZE                       equ 0001h
CLC3SEL0_D1S0_LENGTH                     equ 0001h
CLC3SEL0_D1S0_MASK                       equ 0001h
CLC3SEL0_D1S1_POSN                       equ 0001h
CLC3SEL0_D1S1_POSITION                   equ 0001h
CLC3SEL0_D1S1_SIZE                       equ 0001h
CLC3SEL0_D1S1_LENGTH                     equ 0001h
CLC3SEL0_D1S1_MASK                       equ 0002h
CLC3SEL0_D1S2_POSN                       equ 0002h
CLC3SEL0_D1S2_POSITION                   equ 0002h
CLC3SEL0_D1S2_SIZE                       equ 0001h
CLC3SEL0_D1S2_LENGTH                     equ 0001h
CLC3SEL0_D1S2_MASK                       equ 0004h
CLC3SEL0_D1S3_POSN                       equ 0003h
CLC3SEL0_D1S3_POSITION                   equ 0003h
CLC3SEL0_D1S3_SIZE                       equ 0001h
CLC3SEL0_D1S3_LENGTH                     equ 0001h
CLC3SEL0_D1S3_MASK                       equ 0008h
CLC3SEL0_D1S4_POSN                       equ 0004h
CLC3SEL0_D1S4_POSITION                   equ 0004h
CLC3SEL0_D1S4_SIZE                       equ 0001h
CLC3SEL0_D1S4_LENGTH                     equ 0001h
CLC3SEL0_D1S4_MASK                       equ 0010h
CLC3SEL0_D1S5_POSN                       equ 0005h
CLC3SEL0_D1S5_POSITION                   equ 0005h
CLC3SEL0_D1S5_SIZE                       equ 0001h
CLC3SEL0_D1S5_LENGTH                     equ 0001h
CLC3SEL0_D1S5_MASK                       equ 0020h
CLC3SEL0_D1S6_POSN                       equ 0006h
CLC3SEL0_D1S6_POSITION                   equ 0006h
CLC3SEL0_D1S6_SIZE                       equ 0001h
CLC3SEL0_D1S6_LENGTH                     equ 0001h
CLC3SEL0_D1S6_MASK                       equ 0040h
CLC3SEL0_D1S7_POSN                       equ 0007h
CLC3SEL0_D1S7_POSITION                   equ 0007h
CLC3SEL0_D1S7_SIZE                       equ 0001h
CLC3SEL0_D1S7_LENGTH                     equ 0001h
CLC3SEL0_D1S7_MASK                       equ 0080h
CLC3SEL0_LC3D1S0_POSN                    equ 0000h
CLC3SEL0_LC3D1S0_POSITION                equ 0000h
CLC3SEL0_LC3D1S0_SIZE                    equ 0001h
CLC3SEL0_LC3D1S0_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S0_MASK                    equ 0001h
CLC3SEL0_LC3D1S1_POSN                    equ 0001h
CLC3SEL0_LC3D1S1_POSITION                equ 0001h
CLC3SEL0_LC3D1S1_SIZE                    equ 0001h
CLC3SEL0_LC3D1S1_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S1_MASK                    equ 0002h
CLC3SEL0_LC3D1S2_POSN                    equ 0002h
CLC3SEL0_LC3D1S2_POSITION                equ 0002h
CLC3SEL0_LC3D1S2_SIZE                    equ 0001h
CLC3SEL0_LC3D1S2_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S2_MASK                    equ 0004h
CLC3SEL0_LC3D1S3_POSN                    equ 0003h
CLC3SEL0_LC3D1S3_POSITION                equ 0003h
CLC3SEL0_LC3D1S3_SIZE                    equ 0001h
CLC3SEL0_LC3D1S3_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S3_MASK                    equ 0008h
CLC3SEL0_LC3D1S4_POSN                    equ 0004h
CLC3SEL0_LC3D1S4_POSITION                equ 0004h
CLC3SEL0_LC3D1S4_SIZE                    equ 0001h
CLC3SEL0_LC3D1S4_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S4_MASK                    equ 0010h
CLC3SEL0_LC3D1S5_POSN                    equ 0005h
CLC3SEL0_LC3D1S5_POSITION                equ 0005h
CLC3SEL0_LC3D1S5_SIZE                    equ 0001h
CLC3SEL0_LC3D1S5_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S5_MASK                    equ 0020h
CLC3SEL0_LC3D1S6_POSN                    equ 0006h
CLC3SEL0_LC3D1S6_POSITION                equ 0006h
CLC3SEL0_LC3D1S6_SIZE                    equ 0001h
CLC3SEL0_LC3D1S6_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S6_MASK                    equ 0040h
CLC3SEL0_LC3D1S7_POSN                    equ 0007h
CLC3SEL0_LC3D1S7_POSITION                equ 0007h
CLC3SEL0_LC3D1S7_SIZE                    equ 0001h
CLC3SEL0_LC3D1S7_LENGTH                  equ 0001h
CLC3SEL0_LC3D1S7_MASK                    equ 0080h

